#-----------------------------------写在前面---------------------------------------------------------------

# pie()函数是按输入的数据顺序从12点方向开始逆时针绘制饼图的每一个区块，
# 若输入的数据已按升序排好，画出的图如饼图1所示，
# 但人习惯从上往下看，所以原则上来说将占比大的区块放在靠近12点的位置会比较号，
# 此时先将数据按降序排好，保证绘制的区块从12点开始逆时针依次变小，
# 再将最大的数据（第一行）排到最后一行，使最大的区块在12点右侧，最终结果如饼图2所示

#-----------------------------------用到的包---------------------------------------------------------------

library(graphics)
library(RColorBrewer)  
library(dplyr)

#-----------------------------------绘图的数据-------------------------------------------------------------

df <- data.frame(value = c(24.20,30.90,12.50,12.30,8.10,12.10), 
                 group = c('LVS','SJM','MCE','Galaxy','MGM','Wynn'))
df

#-----------------------------------饼图1------------------------------------------------------------------


df <-arrange(df,value)  #arrange()函数是dplyr包中的一个函数，用于对数据框（data frame）进行排序操作
                        #默认升序
df

labs <- paste0(df$group," \n(", round(df$value/sum(df$value)*100,2), "%)")

pie(df$value,labels=labs, init.angle=90, col=brewer.pal(nrow(df), "Reds"),
    border="black")

#------------------------------------饼图2-----------------------------------------------------------------


df <-arrange(df,desc(value))       #arrange()函数用于对数据框进行排序操作，
df                                 #desc()函数是dplyr包中的一个函数，用于指定降序排序

df$color<-rev(brewer.pal(nrow(df), "Blues"))
df

df<-df[c(2:nrow(df),1),]           #c(2:nrow(df), 1) 表示一个索引向量，
df                                 #该索引向量的内容是从第二行到最后一行的索引值（2:nrow(df)），以及第一行的索引值（1）
                                   #作用是将数据框df的第一行移动到了最后，而其他行移到前头且顺序保持不变

labs <- paste0(df$group," \n(", round(df$value/sum(df$value)*100,2), "%)")

pie(df$value,labels=labs, init.angle=90,col = df$color,
    border="black")

#------------------------------------另一种颜色方案-------------------------------------------------------
n<-6
gg_color_hue <- function(n) {hues = seq(15, 375, length = n + 1); #使用seq()函数生成一个从 15 到 375 之间的等间距序列，
                                                                  #其中序列的长度为 n + 1
                                                                  #生成的序列存储在变量hues中

                             hcl(h = hues, l = 65, c = 100)[1:n]} #hcl()函数以色相（hue）、亮度（lightness）和饱和度（chroma）作为参数，并返回相应的颜色
                                                                  #此时色相使用 hues 序列的值，亮度固定为 65，饱和度固定为 100
                                                                  #将hues序列中的值转换为对应的颜色。

pie(df$value,labels=labs, init.angle=90,col =gg_color_hue(n),
    border="black")
